In [1]:
#pre-processing, handling missing value, outliers treatment, label encoding

In [2]:
#in ML, if we run data set with missing values it will throw error, either we have to drop that data or fill it with
#some data

In [3]:
#handling missing values - 1. Inputation - replace with new value - either by mean/median
#if no outlier prefer mean
#prefer median if there is outlier
#2.Drop/delete entire row/obervation
 
#Always try imputation approach

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import os
os.getcwd()

'/home/justdial/learnbae_ml/Statistics/Stats-5'

In [5]:
df =pd.read_excel("data_preprocessing.xlsx")
df.head()

  Dept   Age Experience   Salary       Education  Projects
0   HR  32.0          9  40000.0  Under_Graduate       0.0
1   HR  33.0         12  48000.0          Master       0.0
2   IT  35.0         12  45000.0          Master       5.0
3   IT   NaN         12  46000.0        Graduate       5.0
4   HR  34.0         11      NaN        Graduate       2.0

In [6]:
df.describe()

             Age        Salary   Projects
count  30.000000     31.000000  27.000000
mean   37.333333  41983.870968   2.148148
std    18.690461  15998.168578   1.261980
min     0.000000  20000.000000   0.000000
25%    29.500000  35500.000000   1.000000
50%    34.500000  42000.000000   2.000000
75%    48.750000  45250.000000   3.000000
max    75.000000  90000.000000   5.000000

In [7]:
df.describe(include="O")

       Dept  Experience Education
count    31          29        31
unique    4          15         5
top      HR          12    Master
freq     13           6        12

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         30 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [9]:
#here total entries are 33, but dept has just 31 non-null, age 30 non-null
#means it has missing values

In [10]:
df.isnull().sum()

Dept          2
Age           3
Experience    4
Salary        2
Education     2
Projects      6
dtype: int64

In [11]:
df.isnull().sum().sum()

19

In [12]:
df.isnull().any()

Dept          True
Age           True
Experience    True
Salary        True
Education     True
Projects      True
dtype: bool

In [13]:
#calculate per of missing value for each colmn
df.isnull().sum()/len(df)*100

Dept           6.060606
Age            9.090909
Experience    12.121212
Salary         6.060606
Education      6.060606
Projects      18.181818
dtype: float64

In [14]:
# in above 1st approach - if we have very small missing value - 0.05% - we can drop that row
# in above 2nd approach - if we have very large missing value more than 50per-we can drop that column

In [15]:
df1=df.copy()

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         30 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [17]:
#if type is object, it is categorical, so we have to apply mode

In [18]:
#handling AGE missing value - through mean/median

In [19]:
#fillna - wherever missing values it will repalce with mean
#age has 31 non-empty, but still has empty values
df1['Age'] = df1['Age'].fillna(df1['Age'].mean())

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [21]:
#fillna - wherever missing values it will repalce with MEDIAN
#age has 31 non-empty, but still has empty values
#df1['Age'] = df1['Age'].fillna(df1['Age'].median())

In [22]:
#handling SALARY missing value - through mean/median

In [23]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      31 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [24]:
#here salary has 31 non-null, still has 2 empty values, here we apply median

In [25]:
df1['Salary'] = df1['Salary'].fillna(df1['Salary'].median())

In [26]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  29 non-null     object
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [27]:
#above exp has d-type has object, ideally it shud be flaot/int, because some random data is there
#and if we apply median/mean it will throw error

In [28]:
#this wud throw error
#df1['Experience'] = df1['Experience'].fillna(df1['Experience'].median())

In [29]:
#here if we apply mode it will work as it is object
#but ideally it shud be flaot, becuase of wrong data it is object
#we shud apply median/mean - for this we have to CONVERT object to numeric

In [30]:
#will throw error
#df1['Experience'] = pd.to_numeric(df1['Experience'])

In [31]:
#above we got to know where error is there

In [32]:
df1['Experience'].mask((df1['Experience'].eq(".")), inplace=True)
#inplace it does in df1, instead of createing new var

In [33]:
df1['Experience'].isnull().sum()

5

In [34]:
#so now we convereted '.' to empty, so it increases frm 4 to 5
#now again check converting to median

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  28 non-null     object
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [36]:
#its still object

In [37]:
#will throw error
#df1['Experience'] = pd.to_numeric(df1['Experience'])

In [38]:
#ALL THIS IS DATA CLEANING

In [39]:
df1['Experience'].mask((df1['Experience'].eq("%")), inplace=True)

In [40]:
df1['Experience'].isnull().sum()

6

In [41]:
#will throw error
#df1['Experience'] = df1['Experience'].fillna(df1['Experience'].median())

In [42]:
df1['Experience'].mask((df1['Experience'].eq("a")), inplace=True)

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  26 non-null     object
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.7+ KB

In [44]:
df1['Experience'] = df1['Experience'].fillna(df1['Experience'].median())

In [45]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  33 non-null     float64
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    27 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.7+ KB

In [46]:
#now  experience is cleaned and null values is replaced

In [47]:
df1['Projects'] = df1['Projects'].fillna(df1['Projects'].mean())

In [48]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  33 non-null     float64
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    33 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.7+ KB

In [49]:
#we can handle categorical varaible(object ) with mode approach

In [50]:
df1['Dept'] = df1['Dept'].fillna(df1['Dept'].mode())

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        31 non-null     object
 1   Age         33 non-null     float64
 2   Experience  33 non-null     float64
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    33 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.7+ KB

In [52]:
#it still didnt work, because we shud send 1st mode

In [53]:
df1['Dept'] = df1['Dept'].fillna(df1['Dept'].mode()[0])
#applying 1st mode

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Dept        33 non-null     object
 1   Age         33 non-null     float64
 2   Experience  33 non-null     float64
 3   Salary      33 non-null     float64
 4   Education   31 non-null     object
 5   Projects    33 non-null     float64
dtypes: float64(4), object(2)
memory usage: 1.7+ KB

In [55]:
#will throw error
#df1['Education'] = df1['Education'].fillna(df1['Education'].mode()[2])

KeyError: 2

In [ ]:
#above it threw error, as it is out of range , so always pass 1st mode

In [ ]:
df1['Education'] = df1['Education'].fillna(df1['Education'].mode()[0])

In [ ]:
df1.describe()

In [ ]:
df1.info()

In [ ]:
#no missing data evrryting 33

In [ ]:
df1['Dept'].value_counts()

In [ ]:
df1['Education'].value_counts()

In [ ]:
#ALWAYS for Categorical data, check value_counts, above we have wrong data, a and ?, now clean the data

In [ ]:
df1['Education'] = df1['Education'].replace("?",df1['Education'].mode()[0])

In [ ]:
df1['Education'].value_counts()

In [ ]:
#now it replaced ? with master

In [ ]:
df1['Education'] = df1['Education'].replace("a",df1['Education'].mode()[0])

In [ ]:
df1['Education'].value_counts()

In [ ]:
df1.describe()

In [ ]:
#ABOVE, AGE has minn value is 0, its interpretation is very wrong,, there can be no age wth 0 value
#so age value of 0 value shud be replaaced

In [ ]:
df1['Age'] = df1['Age'].replace(0,df1['Age'].mean())

In [ ]:
df1.describe()

In [ ]:
#now age min value is 29, instead of 0

In [ ]:
#handling multi columns missing value in one line

In [ ]:
cat_cols =['Dept', 'Education']

In [ ]:
df2 = df1.copy()

In [ ]:
df2[cat_cols]=df2[cat_cols].fillna(df2[cat_cols].mode().iloc[0])

In [ ]:
num_col = ['Age', 'Experience', 'Projects']

In [ ]:
df2[num_col]=df2[num_col].fillna(df2[num_col].mean())

In [ ]:
#2nd METHOD - DROP approach

In [ ]:
df3.dropna(inplace=True)#will drop all rows with NAN value in any column

# Feature Engineering - Outlier Treatment

In [ ]:
df1.info()

In [ ]:
sns.boxplot(data=df1)

In [ ]:
df1.describe()

In [ ]:
sns.boxplot(y="Salary",data=df1)

In [ ]:
#it seems there is a outlier

# but we confirm using IQR AAPPROACH

In [ ]:
Q1 = df1.quantile(0.25)
Q3 = df1.quantile(0.75)
iqr = Q3-Q1
upper_fence= Q3+1.5*iqr
lower_fence= Q1-1.5*iqr
print('upper fence \n', upper_fence)
print('lowe fence \n', lower_fence)

# Adjustment of outliers - 1. Removal of outliers

In [ ]:
#Removal of outliers
df10 = df1[~((df1<lower_fence)|(df1>upper_fence)).any(axis=1)]

In [ ]:
df1.describe()

In [ ]:
df10.describe()

In [ ]:
#compared to df1, salary max has been droppped, everything less than lowerfence & more than upper_fence is dropped

In [ ]:
df10.info()

In [ ]:
sns.boxplot(y="Salary", data=df10)

In [ ]:
#here we can still see one dot, but that is nt outlier, its  value  is q1-1.5itr

# Adjustment of outliers - 2. Flooring or Caping option - no delete

In [ ]:
Q1 = df1.quantile(0.25)
Q3 = df1.quantile(0.75)
iqr = Q3-Q1
upper_fence= Q3+1.5*iqr
lower_fence= Q1-1.5*iqr
print('upper fence \n', upper_fence)
print('\n lower fence \n', lower_fence)

In [ ]:
#here in flooring or capping, we will not drop the outliers, but replace it with some values

In [ ]:
df11=df1.copy()

In [ ]:
df11.describe()

In [ ]:
#here we are replacing age > higher fence with higher fence and age < lower fence with lower fence
df11['Age'] = np.where(df11['Age']>upper_fence['Age'],upper_fence['Age'], np.where(df11['Age']<lower_fence['Age'], lower_fence['Age'],df11['Age']))

In [ ]:
df11.describe()

In [ ]:
#here min is replaced with lower fence,10 and max is replaced with higher fence 73.8

In [ ]:
#can be done on salary

In [ ]:
df11.info()

In [ ]:
# in cappoing, observations are not dropped unlike removing/deleting outliers

# using z-score method

In [ ]:
#upper_fence=mean+3sd(standard deviaition)
#lower_fence=mean-3sd(standard deviaition)

In [ ]:
df12 =df1.copy()

In [ ]:
df12.describe()

In [ ]:
up_fence = df12.mean()+3*df12.std()
lower_fence = df12.mean()-3*df12.std()
print('upper fence \n ', up_fence)
print('lower fence \n ', lower_fence)

In [ ]:
#z-score  is not much used , beacause here age upper fence is 90 & age lower fence is -16
#actually age itself has max till 75  only
#only 5% of data will be 3*s.d

# label encoding

In [ ]:
df11.info()

In [ ]:
#here Dept,Education etc are categorical data
#ml algo will not be able to work on categorical data, so its required to convert categorical values(string) to numbers
#this is called label encoding

In [ ]:
#so once categorical data is replaced with numbers, it is ready to feed to ml model

In [ ]:
df11['Dept'].value_counts()

In [ ]:
#label encoding follows dicitonary pattern- first letter in Dept name, HR - 0, IT- 1, Marketing - 2, Sales- 3

In [ ]:
df14 = df11.copy()

# 1st aproach - function astype approach

In [ ]:
df14['Dept'] = df14['Dept'].astype('category')
#this will treat it as catgeory

In [ ]:
df14.head()

In [ ]:
df14['Dept'] = df14['Dept'].cat.codes
#this will convert to codes

In [ ]:
df14.head()

In [ ]:
df14['Education'] = df14['Education'].astype('category').cat.codes

In [ ]:
df14.head()

In [ ]:
#here we can see it replaced Education and Dept with numbers, this is done with alphabetical order

In [ ]:
df14.head(100)

In [ ]:
df14.info()

In [ ]:
#now even data type of Dept,Education changed frm object to int

# 2nd aproach(label encoding) - sklearn label encoder

In [ ]:
df15 = df1.copy()

In [ ]:
from sklearn import preprocessing

In [ ]:
label = preprocessing.LabelEncoder()

In [ ]:
df15['Dept'] = label.fit_transform(df15['Dept'])

In [ ]:
df15.head()

In [ ]:
df15['Education'] = label.fit_transform(df15['Education'])

In [ ]:
df15.head()

In [ ]:
df17 = df1.copy()

In [ ]:
df17['Education'] = label.fit(df16['Education'])

In [ ]:
df17['Education'] = label.transform(df16['Education'])

In [ ]:
df17.head()

# one hot encoding

In [ ]:
#we use this becuase for one categorical data it will not assign one large number
#suppose if we 25 Dept, label encoding can assign for one cateory 0 , for last it wil be 25
#machine will give weighatge to one value which is 25, instaeda of category with 0
#we need to remove this weightage
#hence we go for one hot encoding
#here for Dept, it wil create colmns for each category 
#                    hr it tech
#1st row if it is hr - 1 0   0
#2nd row if it s it -  0 1   0

#disadvantage - it creates unnecessary extra columns, makes data complex
#creates sparse data - useless data

#so only if distinct catgeories are huge in number, we can go wth this
#if no of catgeories is just 3/4, we can use above approach

In [ ]:
#get_dummies approach

In [ ]:
df17 = df1.copy()

In [ ]:
df17.head()

In [ ]:
df17 = pd.get_dummies(df17, columns=['Dept', 'Education'])

In [ ]:
df17.head(100)

In [ ]:
#multi collinearity - machine will not learn new thing
#we should drop dummy column because machine are not learning any new information
#the macnine knows there are  4 depts, if 
#if in that row it says 1 0 0 obviously Dept_marleting wil be 0 , it doesnt last extra column to understand, 
#it wud be obvious
#the last column wil not help in learning new thing

In [ ]:
df17_dropdummy=df17.drop(["Dept_HR","Education_Graduate"],axis=1)

In [ ]:
df17_dropdummy.head()

In [ ]:
#here dept_it, and one column in  education got dropped

In [ ]:
df17.corr()